{
  "career": [
    "A significant opportunity will present itself in your professional life soon.",
    "Your dedication will be recognized by those who matter.",
    "A career change may be on the horizon, embrace the challenge.",
    "Your expertise will be sought after in unexpected ways.",
    "Financial prosperity awaits those who persevere.",
    "A mentor will appear when you need guidance most.",
    "Your next project will exceed all expectations.",
    "Leadership opportunities will come naturally to you.",
    "Your innovative ideas will gain traction soon.",
    "Success is closer than it appears."
  ],
  "love": [
    "Love will find you when you least expect it.",
    "A meaningful connection awaits in your near future.",
    "Your relationships will deepen and strengthen.",
    "Someone special is thinking of you right now.",
    "Romance blooms in unexpected places.",
    "Your heart knows the answer you seek.",
    "Trust your instincts in matters of the heart.",
    "A past connection may resurface with new meaning.",
    "Love requires both courage and patience.",
    "Your authenticity attracts the right people."
  ],
  "health": [
    "Your energy levels will increase dramatically soon.",
    "A positive change in routine will benefit your wellbeing.",
    "Listen to what your body is telling you.",
    "Mental clarity comes from physical activity.",
    "Your health journey inspires others.",
    "Small changes lead to significant improvements.",
    "Prioritize rest and recovery.",
    "Your vitality is your greatest asset.",
    "Healing begins from within.",
    "Balance in all things brings optimal health."
  ],
  "general": [
    "An unexpected message will brighten your day.",
    "Your intuition is particularly strong right now.",
    "A creative solution to a problem will emerge.",
    "Good news travels faster than you think.",
    "Your positive attitude creates positive outcomes.",
    "An old friend will reconnect with good news.",
    "Your patience will be rewarded handsomely.",
    "A surprise opportunity is heading your way.",
    "Trust the process, even when the path is unclear.",
    "Your unique perspective is your greatest strength."
  ]
}